Repository: ShmerlingMax/BMI-calculator
Catalog: lib/l10n/intl_*.arb
Languages: ru

# app_name
source: BMI Calculator
ru: Калькулятор ИМТ

# app_bar_title
source: Body mass index
ru: Индекс массы тела

# info_window_title
source: What is the body mass index?
ru: Что такое индекс массы тела?

source: Age:
ru: Возраст:

source: Height:
ru: Рост:

source: Weight:
ru: Вес:

# info_window_context
source: BMI is the body mass index, an indicator that displays the degree of the ratio of height and weight. Based on the obtained figure, we can conclude whether the body weight is sufficient, insufficient or excessive. It is widely used in therapy, in the treatment of diseases associated with excess weight, allows you to choose the required treatment directions.
ru: ИМТ — индекс массы тела, показатель, отображающий степень соотношения роста и веса. На основании полученной цифры можно сделать вывод: является ли масса тела достаточной, недостаточной или избыточной. Он широко используется в терапии, при лечении заболеваний, связанных с избыточным весом, позволяет подобрать требуемое направления лечения.

source: close
ru: закрыть

# result_title
source: Your BMI:
ru: Ваш ИМТ:

# weight_range
source: Your healthy weight range:
ru: Ваш диапазон здорового веса:

# weight_category_1
source: Underweight
ru: Дефицит массы тела

# weight_category_2
source: Healthy weight
ru: Нормальная масса тела

# weight_category_3
source: Pre-obesity
ru: Предожирение

# weight_category_4
source: Obesity class I
ru: Ожирение I степени

# weight_category_5
source: Obesity class II
ru: Ожирение II степени

# weight_category_6
source: Obesity class III
ru: Ожирение III степени

source: Obesity
ru: Ожирение

# conclusion_lack
source: Your BMI below the norm indicates that you are underweight. This can lead to health problems. You should consult a doctor or a nutritionist for health advice.
ru: Ваш ИМТ ниже нормы говорит о недостаточном весе. Это может привести к проблемам со здоровьем. Вам следует обратиться к врачу или диетологу для консультации по вопросам здоровья.

# conclusion_normal
source: Congratulations, your BMI is within normal limits. Try to continue to maintain a healthy lifestyle, this will significantly reduce the risk of health problems.
ru: Поздравляю, ваш ИМТ в пределах нормы. Старайтесь и дальше поддерживать здоровый образ жизни, это значительно снизит риск появления проблем со здоровьем.

# conclusion_obesity
source: Your BMI above the norm indicates that you are overweight. This can lead to health problems. You should consult a doctor or a nutritionist for health advice.
ru: Ваш ИМТ выше нормы говорит о избыточном весе. Это может привести к проблемам со здоровьем. Вам следует обратиться к врачу или диетологу для консультации по вопросам здоровья.

source: Conclusion:
ru: Вывод:

# share_app
source: Share this app
ru: Поделиться приложением

# rate_app
source: Rate this app
ru: Оценить приложение

# more_app
source: More apps
ru: Больше приложений

source: Help & Support
ru: Помощь & Поддержка

# open_mail
source: Error opening the mail app
ru: Ошибка открытия приложения почты

# no_mail
source: No mail apps installed.
ru: Ни одного приложения почты не установаленно.

# open_url
source: Error opening the link
ru: Ошибка открытия ссылки

# no_url
source: The link was not found.
ru: Ссылка не найдена.

# share_1
source: My BMI is
ru: Мой ИМТ равен

# share_2
source: Do you want to know your BMI? Download the app
ru: Хочешь узнать свой? Скачивай приложение
